docs: 用Mermaid优化文档中的图表
